docs/posts/solutions-to-CSES.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Solutions to CSES Problemset</title>
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">Solutions to CSES Problemset</h1>
</header><div id="outline-container-org7709876" class="outline-2">
<h2 id="org7709876">Introductory Problems</h2>
<div class="outline-text-2" id="text-org7709876">
</div>
<div id="outline-container-org6e69789" class="outline-4">
<h4 id="org6e69789"><span class="done DONE">DONE</span> Weird Algorithm</h4>
</div>
<div id="outline-container-org4a9d954" class="outline-4">
<h4 id="org4a9d954"><span class="done DONE">DONE</span> Missing Number</h4>
</div>
<div id="outline-container-orgca94321" class="outline-4">
<h4 id="orgca94321"><span class="done DONE">DONE</span> Repetitions</h4>
</div>
<div id="outline-container-org39fc7e8" class="outline-4">
<h4 id="org39fc7e8"><span class="done DONE">DONE</span> Increasing Array</h4>
</div>
<div id="outline-container-orgfe9b80c" class="outline-4">
<h4 id="orgfe9b80c"><span class="done DONE">DONE</span> Permutations</h4>
</div>
<div id="outline-container-org7ca775e" class="outline-4">
<h4 id="org7ca775e"><span class="done DONE">DONE</span> Number Spiral</h4>
</div>
<div id="outline-container-org4f40870" class="outline-4">
<h4 id="org4f40870"><span class="done DONE">DONE</span> Two Knights</h4>
</div>
<div id="outline-container-org2bba2e8" class="outline-4">
<h4 id="org2bba2e8"><span class="done DONE">DONE</span> Two Sets</h4>
<div class="outline-text-4" id="text-org2bba2e8">
<p>
<a href="https://cses.fi/problemset/result/14520711/">Problem</a>
</p>

<p>
First of all we need to check whether we can divide numbers 1 to n into two groups with equal sum. This means that we need to be able to divide the sum of 1 to n into two, in other words the sum of 1 to n is even.
\[ S_n = n * (n + 1) / 2 \]
</p>

<p>
Later we need to divide them into two groups with equal sum.
</p>
<div class="org-src-container">
<pre class="src src-C++">    <span style="color: #66D9EF; font-style: italic;">vll</span> <span style="color: #F8F8F2;">s1</span>, <span style="color: #F8F8F2;">s2</span>;
    <span style="color: #66D9EF; font-style: italic;">vll</span> <span style="color: #F8F8F2;">visited</span>(n+1, 0);

    <span style="color: #66D9EF; font-style: italic;">ll</span> <span style="color: #F8F8F2;">sum</span> = n*(n+1)/4;
    <span style="color: #66D9EF; font-style: italic;">ll</span> <span style="color: #F8F8F2;">sum_s1</span> = 0;
    <span style="color: #66D9EF; font-style: italic;">ll</span> <span style="color: #F8F8F2;">max</span> = n;

    <span style="color: #F92660;">while</span> (sum &gt; sum_s1) {
        <span style="color: #66D9EF; font-style: italic;">ll</span> <span style="color: #F8F8F2;">remaining</span> = sum - sum_s1;

        <span style="color: #F92660;">if</span> (remaining &gt; max) {
            s1.pb(max);
            visited[max] = 1;
            sum_s1 += max;
            max--;
        } <span style="color: #F92660;">else</span> {
            s1.pb(remaining);
            visited[remaining] = 1;
            sum_s1 = sum;
        }
    }

    <span style="color: #F92660;">for</span> (<span style="color: #66D9EF; font-style: italic;">ll</span> <span style="color: #F8F8F2;">i</span> = 1; i &lt;= n; i++) {
        <span style="color: #F92660;">if</span> (visited[i] == 0) {
            s2.push_back(i);
        }
    }
</pre>
</div>

<p>
Although not directly related, there is a similar problem in number theory named <a href="https://en.wikipedia.org/wiki/Partition_problem">partition problem</a>.
</p>

<p>
<code>keywords</code>: parity, partition problem, greedy algorithm
</p>
</div>
</div>
<div id="outline-container-org3cdc968" class="outline-4">
<h4 id="org3cdc968"><span class="done DONE">DONE</span> Bit Strings</h4>
<div class="outline-text-4" id="text-org3cdc968">
<p>
<a href="https://cses.fi/problemset/task/1617">Problem</a>
</p>

<p>
The solution to this problem is pretty simple and straight forward. All we need to do is to calculate \(2^n\). The problem is that for large n&rsquo;s the
solution takes a long time to compute. Therefore we have to implemented an algorithm called <a href="https://cp-algorithms.com/algebra/binary-exp.html">Binary Exponentiation</a> to compute this power in O(log n).
</p>
</div>
</div>
<div id="outline-container-org82c3425" class="outline-4">
<h4 id="org82c3425"><span class="done DONE">DONE</span> Trailing Zeros</h4>
</div>
<div id="outline-container-orgc6aa24c" class="outline-4">
<h4 id="orgc6aa24c"><span class="done DONE">DONE</span> Coin Piles</h4>
</div>
<div id="outline-container-org06a04f5" class="outline-4">
<h4 id="org06a04f5"><span class="done DONE">DONE</span> Palindrome Reorder</h4>
</div>
<div id="outline-container-org8c57d4e" class="outline-4">
<h4 id="org8c57d4e"><span class="done DONE">DONE</span> Gray Code</h4>
<div class="outline-text-4" id="text-org8c57d4e">
<p>
<a href="https://cses.fi/problemset/task/2205">Problem</a>
</p>

<p>
<a href="https://en.wikipedia.org/wiki/Gray_code">Gray Code on Wikipedia</a>
</p>
</div>
</div>
<div id="outline-container-org705926e" class="outline-4">
<h4 id="org705926e"><span class="done DONE">DONE</span> Tower of Hanoi</h4>
<div class="outline-text-4" id="text-org705926e">
<p>
<a href="https://cses.fi/problemset/task/2165/">Problem</a>
One of the most famous problems in computer science. This is can be solved through <b>recursion</b>.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #66D9EF; font-style: italic;">void</span> <span style="color: #A6E22E;">Hanoi</span>(<span style="color: #66D9EF; font-style: italic;">int</span> <span style="color: #F8F8F2;">n</span>, <span style="color: #66D9EF; font-style: italic;">int</span> <span style="color: #F8F8F2;">i</span>, <span style="color: #66D9EF; font-style: italic;">int</span> <span style="color: #F8F8F2;">j</span>, <span style="color: #66D9EF; font-style: italic;">int</span> <span style="color: #F8F8F2;">k</span>) {
    <span style="color: #F92660;">if</span> (n == 0) {
        <span style="color: #F92660;">return</span>;
    }

    Hanoi(n - 1, i, k, j);
    cout &lt;&lt; i &lt;&lt; <span style="color: #E6DB74;">" "</span> &lt;&lt; j &lt;&lt; <span style="color: #E6DB74;">"\n"</span>;
    Hanoi(n - 1, k, j, i);
}
</pre>
</div>

<p>
This basically means that the solution to the whole problem is the same as the solution to a sub-problem of this.
Note: Recursion and <b>induction</b> have something fundamental in common.
</p>

<p>
<a href="https://en.wikipedia.org/wiki/Recursion">Recursion on Wikipedia</a>
<a href="https://en.wikipedia.org/wiki/Tower_of_Hanoi">Tower of Hanoi on Wikipedia</a>
</p>
</div>
</div>
<div id="outline-container-org6c2559c" class="outline-4">
<h4 id="org6c2559c"><span class="done DONE">DONE</span> Creating Strings</h4>
<div class="outline-text-4" id="text-org6c2559c">
<p>
<a href="https://cses.fi/problemset/task/1622/">Problem</a>
</p>

<p>
This was a pretty straight forward problem to solve. All you need to do is to use the recursive technique you have learned before:
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #66D9EF; font-style: italic;">set</span>&lt;<span style="color: #66D9EF; font-style: italic;">string</span>&gt; <span style="color: #A6E22E;">P</span>(<span style="color: #66D9EF; font-style: italic;">string</span> <span style="color: #F8F8F2;">str</span>) {
    <span style="color: #66D9EF; font-style: italic;">set</span>&lt;<span style="color: #66D9EF; font-style: italic;">string</span>&gt; <span style="color: #F8F8F2;">sol</span>;
    <span style="color: #F92660;">if</span> (str.length() == 1) {
        sol.insert(str);
        <span style="color: #F92660;">return</span> sol;
    }

    <span style="color: #F92660;">for</span> (<span style="color: #66D9EF; font-style: italic;">int</span> <span style="color: #F8F8F2;">i</span> = 0; i &lt; str.length(); i++) {
        <span style="color: #66D9EF; font-style: italic;">char</span> <span style="color: #F8F8F2;">c1</span> = str[i];
        <span style="color: #66D9EF; font-style: italic;">string</span> <span style="color: #F8F8F2;">r</span> = rest(str, i);
        <span style="color: #F92660;">for</span> (<span style="color: #F92660;">auto</span> <span style="color: #F8F8F2;">s</span> : P(r)) {
            sol.insert(c1 + s);
        }
    }
    <span style="color: #F92660;">return</span> sol;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc837f26" class="outline-4">
<h4 id="orgc837f26"><span class="todo TODO">TODO</span> Apple Division</h4>
</div>
<div id="outline-container-org514dc77" class="outline-4">
<h4 id="org514dc77"><span class="done DONE">DONE</span> Chessboard and Queens</h4>
<div class="outline-text-4" id="text-org514dc77">
<p>
<a href="https://cses.fi/problemset/task/1624/">Problem</a>
A fantastic problem known as <a href="https://en.wikipedia.org/wiki/Eight_queens_puzzle#Exercise_in_algorithm_design">&ldquo;N Queens problem&rdquo;</a>. The goal is to compute the number of ways we can place n queens on a n by n chessboard such that they do not attack each other. This problem is solved through a technique called <a href="https://en.wikipedia.org/wiki/Backtracking">Backtracking.</a> To put it simply, we check all the possible solutions one by one.
The only challenge we have here is that some squares are already reserved so we need to check for them while putting the queens on the board.
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #F92660; font-weight: bold;">#define</span> <span style="color: #F8F8F2;">N</span> 8

<span style="color: #66D9EF; font-style: italic;">int</span> <span style="color: #F8F8F2;">counter</span> = 0;
<span style="color: #66D9EF; font-style: italic;">vector</span>&lt;<span style="color: #66D9EF; font-style: italic;">int</span>&gt; <span style="color: #A6E22E;">col</span>(<span style="color: #66D9EF; font-style: italic;">N</span>*<span style="color: #F8F8F2;">N</span>);
<span style="color: #66D9EF; font-style: italic;">vector</span>&lt;<span style="color: #66D9EF; font-style: italic;">int</span>&gt; <span style="color: #A6E22E;">diag1</span>(<span style="color: #66D9EF; font-style: italic;">N</span>*<span style="color: #F8F8F2;">N</span>);
<span style="color: #66D9EF; font-style: italic;">vector</span>&lt;<span style="color: #66D9EF; font-style: italic;">int</span>&gt; <span style="color: #A6E22E;">diag2</span>(<span style="color: #66D9EF; font-style: italic;">N</span>*<span style="color: #F8F8F2;">N</span>);
<span style="color: #66D9EF; font-style: italic;">char</span> <span style="color: #F8F8F2;">board</span>[N][N];

<span style="color: #66D9EF; font-style: italic;">void</span> <span style="color: #A6E22E;">solve</span>(<span style="color: #66D9EF; font-style: italic;">int</span> <span style="color: #F8F8F2;">y</span>) {
    <span style="color: #F92660;">if</span> (y == N) {
        counter++;
        <span style="color: #F92660;">return</span>;
    }

    <span style="color: #F92660;">for</span> (<span style="color: #66D9EF; font-style: italic;">int</span> <span style="color: #F8F8F2;">x</span> = 0; x &lt; N; x++) {
        <span style="color: #F92660;">if</span> (board[y][x] == <span style="color: #E6DB74;">'*'</span> || col[x] || diag1[x+y] || diag2[x-y+N-1]) <span style="color: #F92660;">continue</span>;
        col[x] = diag1[x+y] = diag2[x-y+N-1] = 1;
        solve(y+1);
        col[x] = diag1[x+y] = diag2[x-y+N-1] = 0;
    }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org188b66a" class="outline-4">
<h4 id="org188b66a"><span class="todo TODO">TODO</span> Raab Game I</h4>
</div>
<div id="outline-container-orgba3f1dd" class="outline-4">
<h4 id="orgba3f1dd"><span class="todo TODO">TODO</span> Mex Grid Construction</h4>
</div>
<div id="outline-container-orgf74c0f0" class="outline-4">
<h4 id="orgf74c0f0"><span class="todo TODO">TODO</span> Knight Moves Grid</h4>
</div>
<div id="outline-container-orgd63782d" class="outline-4">
<h4 id="orgd63782d"><span class="todo TODO">TODO</span> Grid Coloring I</h4>
</div>
<div id="outline-container-orgc8b5ccf" class="outline-4">
<h4 id="orgc8b5ccf"><span class="todo TODO">TODO</span> Digit Queries I</h4>
</div>
<div id="outline-container-orgae388bb" class="outline-4">
<h4 id="orgae388bb"><span class="todo TODO">TODO</span> String Reorder</h4>
</div>
<div id="outline-container-orgc8f4053" class="outline-4">
<h4 id="orgc8f4053"><span class="todo TODO">TODO</span> Grid Path Description</h4>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025-09-28 Sun 00:00</p>
</div>
</body>
</html>
